
The other day @light_industry turned me onto tmsu, a program that lets you assign tags to files in your file system. Then you can retrieve files by tag, and create a virtual file system that reflects tag structure instead of the hierarchical tree structure that we've been stuck with. 

Hierarchies are for dead trees and chimpanzees. 

** The n-simplexes

(If we're speaking Greek we should say 'n-simplices' but, we're not speaking Greek).)

An subset $S$ of the ground set is a simplex in our tmsu asc iff there is a nonempty set of files tagged with S.

=tmsu files= gets us every file that we've tagged. 
=tmsu tags f= where f is a file gets us the tags for each file. 

So let's compose those to get the "base sets" for our ASC, that is, every set of keywords that is assigned to some file. Every subset of these base sets will also be an element of the ASC (by the previous argument: if ABC are tags for an item then so are AB, AC, BC, and A, B, C).

#+BEGIN_SRC clojure

  (def fs (tmsu "files" {:seq true}))

  (def data (mapcat #(tmsu "tags" % {:seq true}) fs))

  (def f (comp #(drop 1 %) #(clojure.string/split % #": ")))

  (def base-sets
    (let [tag-sets (mapcat f data)]
      (map #(clojure.string/split % #" ") tag-sets)))

#+END_SRC

This sucks and is brittle and has nasty string nonsense in it. You will definitely be going through the SQLite for this later. But, it does work, so we'll use it.

In addition to, the collection of subsets of keywords such that each subset is the tag-set for some file, it is also the case that if a file is tagged with some tag-set, then every subset of that tag-set also tags the file. There is a combinatorial explosion time-bomb-ticking in this region, so we must proceed cautiously. 

I mean, I'm trying to index the files by the tag sets and also the subsets of those tag sets? So then, every subset of the ground set indexes a collection of files. 

#+BEGIN_SRC clojure

(map #(clojure.string/split % #": ") data)

#+END_SRC

yields vectors in which the first component is a string representing a file and the second component is a space-separated string representing the set of tags. So let's, take that, and then work with the subsets function from math.combinatorics.

#+BEGIN_SRC clojure

(require '[clojure.math.combinatorics :refer [subsets]])

(def g (fn [v] [(first v) (remove empty? (subsets (clojure.string/split (second v) #" ")) )]))

(let [data (map #(clojure.string/split % #": ") data)] 
  (mapcat g data))

#+END_SRC

#+RESULTS:
: nil#'ascme.core/g("/home/chiral/notes/anansi.org" (("anansi")) "/home/chiral/notes/antifa.org" (("resistance")) "/home/chiral/notes/capital battlesuit.org" (("money")) "/home/chiral/notes/cryptocurrency.org" (("btc") ("money") ("btc" "money")))

That looks a bit better: filenames mapped to the set of subsets of their tags. Might want to reverse that map, mind.

